import networkx as nx
import matplotlib.pyplot as plt

G = nx.Graph()

edges = [
    ("Академмістечко", "Житомирська"),
    ("Житомирська", "Святошин"),
    ("Святошин", "Нивки"),
    ("Нивки", "Берестейська"),
    ("Берестейська", "Шулявська"),
    ("Шулявська", "Політехнічний інститут"),
    ("Політехнічний інститут", "Вокзальна"),
    ("Вокзальна", "Університет"),
    ("Університет", "Театральна"),
    ("Театральна", "Хрещатик"),
    ("Театральна", "Золоті Ворота"),
    ("Хрещатик", "Арсенальна"),
    ("Хрещатик", "Майдан Незалежності"),
    ("Арсенальна", "Дніпро"),
    ("Дніпро", "Гідропарк"),
    ("Гідропарк", "Лівобережна"),
    ("Лівобережна", "Дарниця"),
    ("Дарниця", "Чернігівська"),
    ("Чернігівська", "Лісова"),
    ("Героїв Дніпра", "Мінська"),
    ("Мінська", "Оболонь"),
    ("Оболонь", "Почайна"),
    ("Почайна", "Тараса Шевченка"),
    ("Тараса Шевченка", "Контрактова площа"),
    ("Контрактова площа", "Поштова площа"),
    ("Поштова площа", "Майдан Незалежності"),
    ("Майдан Незалежності", "Площа Українських Героїв"),
    ("Площа Українських Героїв", "Олімпійська"),
    ("Площа Українських Героїв", "Палац Спорту"),
    ("Олімпійська", "Палац України"),
    ("Палац України", "Либідська"),
    ("Либідська", "Деміївська"),
    ("Деміївська", "Голосіївська"),
    ("Голосіївська", "Васильківська"),
    ("Васильківська", "Виставковий центр"),
    ("Виставковий центр", "Іподром"),
    ("Іподром", "Теремки"),
    ("Сирець", "Дорогожичі"),
    ("Дорогожичі", "Лук'янівська"),
    ("Лук'янівська", "Золоті Ворота"),
    ("Золоті Ворота", "Палац Спорту"),
    ("Палац Спорту", "Кловська",),
    ("Кловська", "Печерська"),
    ("Печерська", "Звіринецька"),
    ("Звіринецька", "Видубичі"),
    ("Видубичі", "Славутич"),
    ("Славутич", "Осокорки"),
    ("Осокорки", "Позняки"),
    ("Позняки", "Харьківська"),
    ("Харьківська", "Вирлиця"),
    ("Вирлиця", "Бориспільська"),
    ("Бориспільська", "Червоний хутір")]

pos = {}

red_line = ["Академмістечко", "Житомирська", "Святошин", "Нивки", "Берестейська",
            "Шулявська", "Політехнічний інститут", "Вокзальна", "Університет",
            "Театральна", "Хрещатик", "Арсенальна", "Дніпро", "Гідропарк",
            "Лівобережна", "Дарниця", "Чернігівська", "Лісова"]

blue_line = ["Героїв Дніпра", "Мінська", "Оболонь", "Почайна", "Тараса Шевченка",
             "Контрактова площа", "Поштова площа", "Майдан Незалежності",
             "Площа Українських Героїв", "Олімпійська", "Палац України",
             "Либідська", "Деміївська", "Голосіївська", "Васильківська",
             "Виставковий центр", "Іподром", "Теремки"]

green_line = ["Сирець", "Дорогожичі", "Лук'янівська", "Золоті Ворота",
              "Палац Спорту", "Кловська", "Печерська", "Звіринецька",
              "Видубичі", "Славутич", "Осокорки", "Позняки", "Харьківська",
              "Вирлиця", "Бориспільська", "Червоний хутір"]

for i, station in enumerate(red_line):
    pos[station] = (i, -len(blue_line)/1.3+i/2)

for i, station in enumerate(blue_line):
    pos[station] = (len(red_line)/2, -i+5.5-i)

for i, station in enumerate(green_line):
    pos[station] = (len(red_line)/3+i, -len(red_line)/3+(-i))

def metro_map():
    G.add_nodes_from(red_line + blue_line + green_line)
    G.add_edges_from(edges)
    return G

if __name__ == "__main__":

    metro_map = metro_map()

    print(f"Кількість станцій (вершин): {metro_map.number_of_nodes()}")
    print(f"Кількість з'єднань (ребер): {metro_map.number_of_edges()}")

    print("\nСтупінь вершин:")
    for node, degree in metro_map.degree():
        print(f"{node}: {degree}")

    plt.figure(figsize=(16, 9))
    nx.draw(metro_map, pos, with_labels=True, node_size=500, node_color='lightblue', font_size=10
            , font_color='black', font_weight='bold', edge_color='gray', width=2)
    plt.show()